src/InformationRegisters/ЗаказДопИнф.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаказДопИнф</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПротоколРасчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаАвторизации</Name>
					<Comment>дата/время регистрации карты лояльности в заказе</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ДополнительныеСвойства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСвойства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗаказДопИнф/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	глПараметрыРМ = глПараметрыРМ;
	Если ПроцедурыОбменаДанными.ОпределитьЭтаИнформационнаяБазаФайловая() Тогда
		Если глПараметрыРМ = Неопределено или НЕ глПараметрыРМ.ККМЕсть Тогда
			Для каждого эл из ЭтотОбъект цикл
				Спр = эл.Заказ.РабочееМесто;
				ИмяФайла = ПолучитьИмяВременногоФайла("txt");
				ЗаписатьОбъектВФайл(ИмяФайла,ЭтотОбъект);
				Профиль = Спр.ПрофильВхода;
				Поз = СтрНайти(Профиль,"\",НаправлениеПоиска.СКонца);
				СтрПуть = Лев(Профиль,Поз-1);
				Наим = Сред(СтрПуть,3);
				Сеть.ПодключитьШару(Наим);
				СтрПуть = СтрПуть + "\";
				Каталог = РегистрыСведений.ДополнительныеСвойства.ЗначениеСвойства(ПараметрыСеанса.ТекущаяИБ, "ПутьДляЛогирования");//Константы.ПутьДляЛогирования.Получить();
				Если Каталог = Неопределено Тогда
					Каталог = Константы.ПутьДляЛогирования.Получить();
				КонецЕсли;
				СтрПуть = СтрПуть + СтрЗаменить(Каталог,":","$");
				СтрПуть = ?(Прав(СтрПуть,1) = "\",СтрПуть,СтрПуть + "\");
				СтрПуть = СтрПуть + Формат(ТекущаяДата(),"ДФ=yyyyMMdd") + "\";
				ИмяфайлаПолучателя = СтрПуть + "ЗаказДопИнфо_" + эл.Заказ.Номер + "_" + Наим + ".txt";
				Попытка
					КопироватьФайл(ИмяФайла,ИмяфайлаПолучателя);
				Исключение
					ЗарегистрироватьСобытие("Ошибка записи файла протокол расчетов",УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект,,"Ошибка доступа до " + Профиль);
				КонецПопытки;
			конеццикла;
		Иначе
			Для каждого эл из ЭтотОбъект цикл
				Каталог = РегистрыСведений.ДополнительныеСвойства.ЗначениеСвойства(ПараметрыСеанса.ТекущаяИБ, "ПутьДляЛогирования");//Константы.ПутьДляЛогирования.Получить();
				Если Каталог = Неопределено Тогда
					Каталог = Константы.ПутьДляЛогирования.Получить();
				КонецЕсли;
				Каталог = ?(Прав(Каталог,1) = "\", Каталог, Каталог + "\") + Формат(ТекущаяДата(),"ДФ=yyyyMMdd") + "\";
				Профиль = эл.Заказ.РабочееМесто.ПрофильВхода;
				Поз = СтрНайти(Профиль,"\",НаправлениеПоиска.СКонца);
				Наим = Сред(Лев(Профиль,поз - 1),3);
				ИмяФайла = "ЗаказДопИнфо_" + эл.Заказ.Номер + "_" + Наим + ".txt";
				ЗаписатьОбъектВФайл(Каталог + ИмяФайла,ЭтотОбъект);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ЗаказОтбор = Неопределено;
	О = Отбор.Найти("Заказ");
	Если НЕ О = Неопределено Тогда
		ЗаказОтбор = О.Значение;
	КонецЕсли;
	ЗарегистрироватьСобытие("Ловушка.РегистрСведений.ЗаказДопИнф", ПредопределенноеЗначение("УровеньЖурналаРегистрации.Примечание"),, ЗаказОтбор, ЛояльностьКлиентСервер.СформироватьJSON(ЭтотОбъект.Выгрузить()));
	
КонецПроцедуры
